[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    
   
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 488,
    "title": " Responsive Web Design (freeCodeCamp)",
    "image_url": "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NHx8cmVzcG9uc2l2ZSUyMGNvZGV8ZW58MHx8MHx8&auto=format&fit=crop&w=500&q=60",
    "details": "Almost every new client these days wants a mobile version of their website. It’s practically essential after all: one design for the BlackBerry, another for the iPhone, the iPad, netbook, Kindle — and all screen resolutions must be compatible, too. In the next five years, we’ll likely need to design for a number of additional inventions. When will the madness stop? It won’t, of course. In the field of Web design and development, we’re quickly getting to the point of being unable to keep up with the endless new resolutions and devices. For many websites, creating a website version for each resolution and new device would be impossible, or at least impractical. Should we just suffer the consequences of losing visitors from one device, for the benefit of gaining visitors from another? Or is there another option?  Responsive Web design is the approach that suggests that design and development should respond to the user’s behavior and environment based on screen size, platform and orientation. The practice consists of a mix of flexible grids and layouts, images and an intelligent use of CSS media queries. As the user switches from their laptop to iPad, the website should automatically switch to accommodate for resolution, image size and scripting abilities. One may also have to consider the settings on their devices; if they have a VPN for iOS on their iPad, for example, the website should not block the user’s access to the page. In other words, the website should have the technology to automatically respond to the user’s preferences. This would eliminate the need for a different design and development phase for each new gadget on the market."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
 
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 488,
    "title": "Full-Stack Web Development with React",
 
   
    "image_url": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1470&q=80",
    "details": "What You’ll Learn You’ll begin the course with an introduction to front-end JavaScript frameworks and libraries. You’ll be introduced to React and its components, followed by the different types of components and single-page applications of React router.Then you’ll move on to controlled and uncontrolled forms, and understand form validation in React applications. You’ll take a look at the Flux architecture pattern and understand how Redux helps realizing it.You’ll dive deeper into Redux by learning about Redux action, combining reducers, and Redux thunk. The course also teaches you about client-server communication using Fetch and the REST API.Then you’ll learn how you can apply animations to your application using React. And finally, you’ll end the course by testing, building, and deploying your React applications."
  },

  {
    "_id": "f69a695f037cd9484cecaea37ca71011",
  
    "category_id": "02",
    "rating": { "number": 4.8, "badge": "Excellent" },
    "total_view": 400,
    "title": "Web development Course Outline 2022",
 
    "image_url": "https://images.unsplash.com/photo-1532622785990-d2c36a76f5a6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1470&q=80",
    "details": "This course is designed to start you on a path toward future studies in web development and design, no matter how little experience or technical knowledge you currently have. The web is a very big place, and if you are the typical internet user, you probably visit several websites every day, whether for business, entertainment or education. But have you ever wondered how these websites actually work? How are they built? How do browsers, computers, and mobile devices interact with the web? What skills are necessary to build a website? With almost 1 billion websites now on the internet, the answers to these questions could be your first step toward a better understanding of the internet and developing a new set of internet skills. By the end of this course you’ll be able to describe the structure and functionality of the world wide web, create dynamic web pages using a combination of HTML, CSS, and JavaScript, apply essential programming language concepts when creating HTML forms, select an appropriate web hosting service, and publish your webpages for the world to see. Finally, you’ll be able to develop a working model for creating your own personal or business websites in the future and be fully prepared to take the next step in a more advanced web development or design course or specialization."
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
  
    "category_id": "03",
    "rating": { "number": 4.3, "badge": "Excellent" },
    "total_view": 400,
    "title": "Document Object Model or the DOM",
 
    "image_url": "https://i.ytimg.com/vi/XYzSyPlY7_E/maxresdefault.jpg",
    "details": "Why Was The Document Object Model (DOM) Needed?During the early years of the internet, there was a browser was between Netscape Navigator 4 and Internet Explorer 4. Both the browsers followed a different version of Dynamic HTML (DHTML) thus proving it difficult to run the same HTML code on different browsers. With increasing fears of the web losing its cross-platform nature a new independent body called the World Wide Web Consortium (W3C) was created. It was the responsibility of W3C to maintain the standards of web communication and that when it started working on the DOM. It is because of the DOM that JavaScript gets the ability to create dynamic HTML and a developer can manipulate the various nodes of a document. There are various methods provided by the DOM as a programming interface that lets you alter the HTML document the way you would want to as a developer"
  },

  {
    "_id": "11468ed61aee84de492a8b04158a22f9",
 
    "category_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 980,
    "title": "Browser Object Model or the BOM",

    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRGYa1fJOuJ-ZKwiNVWf00tyTpf_RLKDx83IQ&usqp=CAU",
    "details":"Just like the DOM is an interface to interact with the document the Browser Object Model is the interface to interact with the browser outside the context of the document itself. The BOM was considered to be quite problematic due to it being the only part of JavaScript which had no standard governing it. However, with the launch of HTML5, most of the features related to BOM became apart of the official standard of HTML5, which led to a massive reduction in the confusion surrounding the BOM. The BOM can be accessed using the window object which represents the browser window. All the global variables are a part of the window object in the browsers. Let’s have a look at how you can access the window object and its propertie"
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f0",

    "category_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 980,
    "title": "7 JavaScript Concepts That Every Web Developer Should Know",

   
    "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20201028214738/7-JavaScript-Concepts-That-Every-Developer-Must-Know.jpg",
    "details": "JavaScript is Everywhere. Millions of web pages are built on JavaScript and it’s not going anywhere at least for now. On one side HTML and CSS give styling to the web pages but on the other side, it’s the magic of JavaScript that makes your web page alive. Today this language is not just limited to your web browser. You can also use it for server-side applications. Isn’t it cool to use a single language for both client-side and server-side applications? A single language fulfills both of the purposes and this is the main reason TON of job posting is there for javascript developers in the tech industry. According to Stack Overflow Developer Survey 2019, JavaScript is the #1 programming language. The language is widely used by 95% of all the websites Whether it’s a small startup or a big company, most of them are working on some kind of website or an app that requires a good knowledge of this language. A lot of frameworks and libraries are there for javascript. These frameworks and libraries can be easily learned if your javascript fundamentals are clear. A lot of concepts are confusing and overwhelming for developers but a good knowledge of these concepts will help you in the long run. Frameworks and libraries come and go but the fundamentals always remain the same. It’s easy to build any kind of application and learn any framework and libraries if the fundamentals are clear. Also, it will help you in interviews as well. Let’s discuss some of the basic concepts of javascript which are important to learn for any JavaScript developer. Become a good front-end developer with Geeksforgeeks JavaScript Foundation – Self Paced and learn all the aspects of web development with ease. "
  },

  {
    "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
 
    "category_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": null,
    "title": "What is an IIFE in JavaScript?",

  
    "image_url": "https://miro.medium.com/max/1200/1*If_wKnqD6lqWRY5qFZvNdg.png",
    "details": "IIFE (Immediately Invoked Function Expression) is a JavaScript function that runs as soon as it is defined.Your first encounter may seem quite confusing but actually, the pattern is simple. The pattern is immediately invoked function expression.JavaScript functions can be created either through a function declaration or a function expression. A function declaration is the “normal” way of creating a named function.A function created in the context of an expression is also a function expression. The key thing about JavaScript expressions is that they return values. In both cases above the return value of the expression is the function.That means that if we want to invoke the function expression right away we just need to tackle a couple of parentheses on the end. Which brings us back to the first bit of code we looked"
  },

  {
    "_id": "a713ee936ff5574273f0f769f5c5b20e",

    "category_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 111,
    "title": "Learn more about js Scope",
   
    "image_url": "https://soshace.com/wp-content/uploads/2019/11/Scope-in-JS-Facebook.jpg",
    "details": "Arguably one of the harder concepts to grasp for a new developer is scope and is an important concept to understand. There are two main types of scope, global and local. When a variable is declared outside of any function it is considered global and can be accessed virtually anywhere within your code. A variable that is declared within a function is considered local and can only be accessed within that function. This is scope at its very basic and can quickly become far more complex, but understanding these concepts as early as possible will help build a solid foundation for you to build from on your road to becoming a web developer."
  },

  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7900",

    "category_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 733,
    "title": "Why JSX?",
   
    "image_url": "https://miro.medium.com/max/1400/1*wQxgEiVsgG0o7ti45WuFTQ.png",
    "details": "React embraces the fact that rendering logic is inherently coupled with other UI logic: how events are handled, how the state changes over time, and how the data is prepared for display.Instead of artificially separating technologies by putting markup and logic in separate files, React separates concerns with loosely coupled units called “components” that contain both. We will come back to components in a further section, but if you’re not yet comfortable putting markup in JS, this talk might convince you otherwise. React doesn’t require using JSX, but most people find it helpful as a visual aid when working with UI inside the JavaScript code. It also allows React to show more useful error and warning messages. With that out of the way, let’s get started! "
  },
  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7901",
 
    "category_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 733,
    "title": "ReactJS | Rendering Elements",

    
    "image_url": "https://magecomp.com/blog/wp-content/uploads/2022/09/Rendering-Elements-in-ReactJS-1024x512.png",
    "details": "In the previous article on introduction to JSX, we got to see how to create a React element. React element is the smallest renderable unit available in React. We can render such elements using the ReactDOM as described in the previous article. React elements are different from DOM elements as React elements are simple javascript objects and are efficient to create. React elements are the building blocks of any React app and should not be confused with React components which will be discussed in further articles. Rendering an Element in React: In order to render any element into the Browser DOM, we need to have a container or root DOM element. It is almost a convention to have a div element with the id=”root” or id=”app” to be used as the root DOM element. Let’s suppose our index.html file has the following statement inside it."
  },

  {
    "_id": "f06f8cc035b04bd1158e4198281915a3",

    "category_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 127,
    "title": "ReactJS Components",
    
    "image_url": "https://media.geeksforgeeks.org/wp-content/uploads/imageedit_12_8490096226.jpg",
    "details": "A Component is one of the core building blocks of React. In other words, we can say that every application you will develop in React will be made up of pieces called components. Components make the task of building UIs much easier. You can see a UI broken down into multiple individual pieces called components and work on them independently and merge them all in a parent component which will be your final UI. You can see in the below image we have broken down the UI of GeeksforGeeks’s homepage into individual components. Google’s custom search at the top can be seen as an individual component, the navigation bar can be seen as an individual component, the sidebar is an individual component, the list of articles or post is also an individual component and finally, we can merge all of these individual components to make a parent component which will be the final UI for the homepage.Components in React basically return a piece of JSX code that tells what should be rendered on the screen. In React, we mainly have two types of components: "
  },
  {
    "_id": "f06f8cc035b04bd1158e4198281915a4",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 127,
    "title": "React Top-Level API",
   
    "image_url": "https://mechomotive.com/wp-content/uploads/2021/08/react.jpg",
    "details": "React is the entry point to the React library. If you load React from a <script> tag, these top-level APIs are available on the React global. If you use ES6 with npm, you can write import React from 'react'. If you use ES5 with npm, you can write var React = require('react'). During server side rendering Suspense Boundaries allow you to flush your application in smaller chunks by suspending.When a component suspends we schedule a low priority task to render the closest Suspense boundary’s fallback. If the component unsuspends before we flush the fallback then we send down the actual content and throw away the fallback."
  },

  {
    "_id": "cd2b53655737cc4077542baea9f8f75d",
  
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 700,
    "title": "Using Tailwind CSS to Accelerate Your Coding",
   
    "image_url": "https://i.ytimg.com/vi/lZp4salRFFc/maxresdefault.jpg",
    "details": "Tailwind CSS makes it quicker to write and maintain the code of your application. By using this utility-first framework, you don’t have to write custom CSS to style your application. Instead, you can use utility classes to control the padding, margin, color, font, shadow, and more of your application.There may be a learning curve to familiarize yourself with these utility classes, but once you do, you’ll be able to create and maintain applications faster than ever before."
  },
  {
    "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
   
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 300,
    "title": "Why we should use Taildwind CSS?",
    
    "image_url": "https://web-crunch.s3.amazonaws.com/uploads/post/feature_image/334/tailwind-css-button-components.jpg",
    "details": "Now you might be wondering why use Tailwind over other CSS frameworks? Tailwind CSS is a low-level framework. Meaning, unlike other CSS frameworks like Bootstrap and Materialize, Tailwind doesn’t offer fully styled components like buttons, dropdowns, and navbars. Instead, it offers utility classes so you can create your own reusable components. For that reason, it provides a lot more flexibility and control over what your application looks like than other CSS frameworks. This can enable you to create a more unique site. To learn more about what Tailwind CSS is, what benefits it offers, and why you should use it, check out this video"
  },
  {
    "_id": "7c4dfea0fafddc813673282a428429b7",
 
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 0,
    "title": "Learn Tailwind CSS - A Beginner's Guide",
   
    "image_url": "https://i.ytimg.com/vi/ApPEK_6KM60/maxresdefault.jpg",
    "details": "This is a beginner-friendly guide to using Tailwind CSS, a relatively new but immensely popular and likely game-changing CSS framework. Tailwind adopts a utility-first approach which makes it easy to customize and even easier to maintain as a project’s CSS grows in size.CSS itself is difficult to manage in large projects and this is further exacerbated by traditional CSS frameworks, like Bootstrap, Foundation, and others which come with a long library of predefined components for common items like buttons, nav bars, footers, and so on. In short, CSS quickly becomes a mess: hard to write, hard to reason about, and even harder to update.Tailwind solves many of these challenges by taking a lower-level approach: providing CSS helper classes that can be used to create and customize any design. It’s best to see this in action though by giving Tailwind a spin yourself.Unfortunately, installing Tailwind CSS can be quite challenging as the official guide makes clear. While you might need all the bells and whistles for a full-fledged project, most of Tailwind can be used via a CDN and a single HTML file. This guide starts off showing how to use the CDN approach, then moves on to the full Node and everything else option after that."
  },
  {
    "_id": "30af81e91ab3eafc0bcae0de62f55d5c",
 
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 320,
    "title": "SASS vs CSS-in-JS vs TailwindCSS",
   
    "image_url": "https://api.zonacoding.com/storage/allphotos/9NKxgNPeRDW0tjdQl6My2BMwR2rZzjlA8xO5Ezfn.jpeg",
    "details": "There are many ways to manage the styling of your application. In the beginning, this is easy, but when your projects start to grow you will encounter difficulties. Using a traditional approach to CSS is not a wrong decision, but nowadays there are other options you could consider. Personally, I like CSS-in-JS a lot and as a JavaScript developer, it makes sense to me to go with this approach.On the other hand, I’ve been working a lot with TailwindCSS lately and I don’t think I’ve ever been that excited about a CSS framework. I made some projects, like RemoteRocket.io, with TailwindCSS and I’ve noticed a huge boost in productivity while working on it. Although it requires some time to learn all the utility classes, you barely need to write any CSS anymore once you master those. And not needing to switch files while styling your HTML elements feels like a blessing.With all that in mind, I’ve made my stack choice: TailwindCSS. If you think differently, please try to change my mind! Any other opinions? Leave them in the comments."
  },
  {
    "_id": "df11ff9feefc37613cc3a4486ce02151",
 
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 552,
    "title": "What is Bootstrap used for?",
    
    "image_url": "https://i.ytimg.com/vi/I7CfaDYzTVM/maxresdefault.jpg",
    "details": "What is Bootstrap used for?Bootstrap makes responsive web design a reality. It makes it possible for a web page or app to detect the visitor's screen size and orientation and automatically adapt the display accordingly. The mobile-first approach assumes smartphones, tabletsand task-specific mobile apps are employees' primary tools for getting work done. Bootstrap addresses the requirements of those technologies in design and includes UI components, layouts, JavaScript tools and the implementation framework. The software is available precompiled or as source code.Mark Otto and Jacob Thornton developed Bootstrap at Twitter to improve the consistency of tools used on the site and to reduce maintenance. The software was formerly known as Twitter Blueprint and is sometimes referred to as Twitter Bootstrap."
  },
  {
    "_id": "919db97c34e0778b387dd40cdfa08130",
  
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 89,
    "title": "Why is Bootstrap called as a framework instead of library or toolkit?",
   
    "image_url": "https://bs-uploads.toptal.io/blackfish-uploads/uploaded_file/file/194523/image-1582754405203-acf85cc241bac1caa6b2cd3a460024f8.png",
    "details": "Honestly, it really doesn’t matter, but for discussion’s sake, it ultimately comes down to how you define the terms “Framework” and “Library”. Personally, I think the cleanest way to define the difference between the terms is that libraries are a bundle of helper utilities that abstract away much of the boilerplate that you’d have to put in just to get something to work. Frameworks tend to provide this as well (usually a lot more), but also restrict you to it’s design pattern, without which, it might not work properly (hence the term “framework”).If you go with these definitions, then whether you call Bootstrap a library or framework depends on what functionality in Bootstrap you are referring to. Personally, I think, for the most part, Bootstrap is mostly just a library of helper utilities. You can even download particular portions of these utilities, while ignoring the others. Frameworks tend to not allow this, as the entire tool is meant to come together in one large monolithic piece. You usually can’t break up frameworks into modular tools that you can select from. This is why Bootstrap doesn’t seem to come across as a framework to me."
  },
  {
    "_id": "374df11ae3d9b8b9ce21f4dc53f59b85",
 
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 798,
    "title": "What is Bootstrap Responsive & How to Use It",
    
    "image_url": "https://www.simplilearn.com/ice9/free_resources_article_thumb/Bootstrap_Responsive.jpg",
    "details": "we discussed the various benefits of using Bootstrap responsive and saw how it performs and how we can create a Responsive Layout with Bootstrap through several examples. This article will be helpful to professional developers from UI/UX designers from the .net backgrounds, application architectures, cloud specialists, testers, and other learners looking for various uses of HTML5 and different Bootstrap CSS. If you wish to learn more about such concepts, you can check out the Full-Stack Web Development Certification Course offered by Simplilearn and become a full-stack technologist.Besides pursuing varied courses by Simplilearn, you can also sign up on our SkillUp platform, a Simplilearn initiative, and improve your career prospects. This platform offers many free online courses to help with the basics of multiple programming languages, including HTML and Bootstrap responsive CSS. "
  },
  {
    "_id": "acb9b6785b62698fc6130db7615965e1",

    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 879,
    "title": "Introduction to Bootstrap Form Layout",
   
    "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2020/07/psd-9-1-2-1.jpg.webp",
    "details": "The bootstrap form layout is an arrangement of user form on the web page using bootstrap. It is a design as per web application helping bootstrap classes. There are three types of form layout in bootstrap3 which are the vertical layout, horizontal layout, and inline layout. There are two types of form layout in bootstrap4 which are vertical layout (Stacked form) and inline layout. The label and bootstrap form attribute set in vertical order known as vertical bootstrap form layout or stacked form. The form label and their bootstrap attribute set in horizontal order known as horizontal form layout. The all form label and their bootstrap attribute set in a single line known as an inline form layout. This is used to make form elegant and attractive on the website."
  },
  {
    "_id": "be44c843d61859cc0b87cae85c55f9db",
 
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 231,
    "title": "Advantages of Bootstrap CSS",
    
    "image_url": "https://honestlot.com/wp-content/uploads/2021/06/luca-bravo-217276-unsplash.jpg",
    "details": "Bootstrap is the most popular free, and open-source framework for creating a responsive layout in web pages, with much less effort. It contains HTML, CSS, and JS components for creating forms, buttons, navigation, dropdown, modals, layout, and many other things, the list is very long indeed. You can create all these without much effort, which otherwise would require a lot of CSS, HTML, and JS code. If you are a web developer then Bootstrap is for you. Bootstrap includes user interface components, layouts, and JS tools along with the framework for implementation. The software is available precompiled or as source code."
  }
  
]